package com.example.ivanov_pr1819_mobil.ui.gpu

import androidx.lifecycle.LiveData
import androidx.lifecycle.MutableLiveData
import androidx.lifecycle.ViewModel

class GpuViewModel: ViewModel() {
    private val _text = MutableLiveData<String>().apply {
        value = "        Это устройство отвечает за формирование и вывод изображения на экран монитора или любого другого аналогичного подключенного устройства. Видеокарты бывают встроенными (интегрированными) и внешними (дискретными). Встроенная видеокарта на сегодняшний день имеется в подавляющем большинстве материнских плат и визуально мы видим лишь её выход – разъём для подключения монитора. Внешняя видеокарта подключается к плате отдельно в виде ещё одной платы со своей системой охлаждения (радиатор или вентилятор).\n" +
                "\n" +
                "        Какая разница между ними, спросите вы? Разница в том, что встроенная видеокарта не предназначена для запуска ресурсоёмких игр, работы в профессиональных редакторах изображения и видео. Ей просто не хватит мощности для обработки такой графики и всё будет сильно тормозить. Встроенная видеокарта на сегодняшний день может использоваться скорее как запасной временный вариант. Для всего остального нужна хоть какая-то простенькая внешняя видеокарта и какая именно уже зависит от предпочтений пользования компьютером: для интернет-сёрфинга, работы с документами или же для игр.\n" +
                "\n" +
                "        Основной характеристикой видеокарты является: разъём для подключения к плате, частота графического процессора (чем она больше, тем лучше), объём и тип видеопамяти, разрядность шины видеопамяти."
    }
    val text: LiveData<String> = _text
}