package com.example.ivanov_pr1819_mobil.ui.case

import androidx.lifecycle.LiveData
import androidx.lifecycle.MutableLiveData
import androidx.lifecycle.ViewModel

class CaseViewModel : ViewModel() {
    private val _text = MutableLiveData<String>().apply {
        value = "        Все те основные компоненты, которые я перечислил выше, должны быть где-то расположены, а не просто валяться на полу, верно? :) Все компоненты компьютера помещаются в специальный корпус (системный блок) для того чтобы исключить на них внешнее воздействие, защитить от повреждений и поддерживать внутри корпуса нужную температуру за счёт имеющихся в нём вентиляторов. Также запускаете вы свой компьютер именно при помощи кнопки на корпусе, поэтому без корпуса никак не обойтись :)\n" +
                "\n" +
                "        Корпуса бывают разного размера и в самый маленький корпус, понятное дело, не поместится, например, стандартная материнская плата. Поэтому основной характеристикой корпуса является формфактор поддерживаемых материнских плат. Если Самые большие корпуса (Full Tower) способны вместить в себя платы любого размера и любые компоненты так, что ещё и будет более-менее свободно и в случае необходимости вынуть какой-либо из компонентов, не возникнет неудобств."
    }
    val text: LiveData<String> = _text
}