package com.example.ivanov_pr1819_mobil.ui.ram

import androidx.lifecycle.LiveData
import androidx.lifecycle.MutableLiveData
import androidx.lifecycle.ViewModel

class RamViewModel: ViewModel()  {
    private val _text = MutableLiveData<String>().apply {
        value = "        Это временная память, в которую подгружаются все запускаемые программы на компьютере, процессы, игровые «миры» (текстуры) и всё остальное. Данная память не предназначена для хранения ваших данных! Поэтому не стоит путать её с памятью, где хранятся все ваши файлы. При выключении и повторном включении компьютера оперативка (так более-менее продвинутые пользователи часто называют оперативную память) будет очищена и по мере запуска вамиразличных программа начнёт снова заполняться. Т.е. это энергозависимая память.\n" +
                "\n" +
                "        Чем больше объём оперативной памяти, тем лучше и тем быстрее будет работать компьютер (конечно, если все остальные компоненты соответствуют уровню). Оперативная память выглядит как небольшие продолговатые планки (модули) и объём одного модуля у памяти поколения DDR4 уже может достигать 128 Гб.!"
    }
    val text: LiveData<String> = _text
}