package com.example.ivanov_pr1819_mobil.ui.slideshow

import androidx.lifecycle.LiveData
import androidx.lifecycle.MutableLiveData
import androidx.lifecycle.ViewModel

class SlideshowViewModel : ViewModel() {

    private val _text = MutableLiveData<String>().apply {
        value = "        Эта самая большая плата в компьютере, которая является связующим звеном между всеми остальными компонентами. К материнской плате подключаются все остальные устройства, включая периферийные. Производителей материнских плат множество, а на верхушке держатся ASUS и Gigabyte, как самые надёжные и одновременно дорогие, соответственно. Основными характеристиками являются: тип поддерживаемого процессора (сокет), тип поддерживаемой оперативной памяти (DDR2, DDR3, DDR4), форм фактор (определяет в какой корпус вы сможете поместить данную плату), а также – типы разъёмов для подключения остальных компонентов компьютера. Например, современные жесткие диски (HDD) и диски SSD подключаются через разъёмы SATA3, видеоадаптеры – через разъёмы PCI-E x16 3.0."
    }
    val text: LiveData<String> = _text
}